app/controllers/api/comments_controller.rb

	def index
		@comment = Comment.where(post_id: params[:post_id])
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = 1