app/controllers/api/posts_controller.rb

	def create
        if(!User.where(id: params[:current_user]).blank?)
---
SELECT "users".* FROM "users"  WHERE "users"."id" IS NULL