app/controllers/api/products_controller.rb

SELECT `products`.* FROM `products`
---
    def index
        respond_with @products = Product.all

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1
---
    def show
    	respond_with @product= Product.find(params[:id])