app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
	def followers
		@followers =  User.find(params[:id]).followers

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def following
		@following = User.find(params[:id]).all_following